Revit 2027 API
FamilyInstance.rotate Method
The family instance will be flipped by 180 degrees. If it can not be rotated, return false, otherwise return true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool rotate()
Public Function rotate As Boolean
public:
bool rotate()
member rotate : unit -> bool
Return Value
Boolean
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace